/*
　　　　　　　　　　　　　／/￣￣|ヽ
　　　　　　　　 ＿　 ／　｜　　　 ||＼
　　　　　　　 /　　ヽ　　　｜　　　|||　 ヽ
　　　　　　 /　　　ヽヽ　　　　　　//　　/
　　　　　 / 　　　　ヽヽ　　　　　//　　　ヽ
　　　　　/ヽヽヽﾉﾍ　ヽヽ　｜　//　//　 /
　　　　 /ヽヽヽﾘ　　V／＼｜ ///ﾍ// /
　　　　 |ヽヽヽﾉ　　　　　　 ＼／　 |/ /
　　　　 |ヽヽ､|　　　　　　　　 /　ﾉ　|/!
　　　　/ヽヽ./ ,.,,,,,,,,,,,,,,,,,,,,,,　 r'´　　|ﾘ
　　　　|,.､ミ |　=ﾓtラー､:::r .r,.ﾐ_-､_ﾚ、　　　　ポルナ＊フ……
　　　　/,､∨　　　￣　 '´｜ |ゞﾆﾞゝ//!
　　　 //rヽヾ　　　　　　／'７!　　 / し!　　　　名のらしていただこう
　　　〈ヾヽ｀　 l　　　　　＼_ノ　　 i l,ﾞ!_ﾍ
　　　|ﾘヾ〃,　 l　　,.=-⌒ﾆ､_､_　∧　',　ヽ　　　J・P…
　 ,.--io'ｲﾞ´l　 l　　 ｀'ｰ:-....-,　//iﾍ　ﾍ　ヽ
　|　　|ﾘ/　 ヽ　　　　　 _　　　/r-!、l,　ヽ　　　　ポ＊ナレフ
　l,　r"/　　　＼　 ,.-:'´:::｀ヽ /∧　 ヽ!
　 Yﾞ　l　　　　　＼::::::::::::::::/´:/ ﾉヽ_,.入
　　　 !　　　　　　　￣￣/:::::/　ヽ/ヽ　ｲ
*/
